Ran Plan for 2 projects:

1. dir: `bruno-athaide-product-test/poc-config-v5` workspace: `default`
1. dir: `bruno-athaide-product-test/poc-config-v5/flags` workspace: `default`
---

### 1. dir: `bruno-athaide-product-test/poc-config-v5` workspace: `default`
<details><summary>Show Output</summary>

```diff
module.flags.data.configcat_products.my_products: Reading...
data.configcat_products.my_products: Reading...
module.flags.data.configcat_products.my_products: Read complete after 1s [id=1756314986]
module.flags.data.configcat_environments.forno_environment: Reading...
module.flags.data.configcat_environments.staging_environment: Reading...
module.flags.data.configcat_environments.prod_environment: Reading...
module.flags.data.configcat_segments.beta_users_segment: Reading...
data.configcat_products.my_products: Read complete after 1s [id=1756314986]
data.configcat_environments.prod_environment: Reading...
data.configcat_segments.beta_users_segment: Reading...
data.configcat_environments.staging_environment: Reading...
data.configcat_environments.forno_environment: Reading...
module.flags.data.configcat_environments.forno_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756314987]
data.configcat_environments.prod_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756314987]
module.flags.data.configcat_environments.staging_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756314987]
module.flags.data.configcat_segments.beta_users_segment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756314987]
module.flags.data.configcat_environments.prod_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756314987]
data.configcat_environments.staging_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756314987]
data.configcat_environments.forno_environment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756314987]
data.configcat_segments.beta_users_segment: Read complete after 0s [id=08ddc62b-f5b3-46de-86fb-342d26c74a4d1756314987]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # configcat_config.my_config will be created
+ resource "configcat_config" "my_config" {
      + description        = "POC Config v5 Description"
      + evaluation_version = "v2"
      + id                 = (known after apply)
      + name               = "POC Config v5"
      + order              = 0
      + product_id         = "08ddc62b-f5b3-46de-86fb-342d26c74a4d"
    }

  # module.flags.configcat_setting.my_first_flag will be created
+ resource "configcat_setting" "my_first_flag" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MyFirstFlag"
      + name         = "My First Flag"
      + order        = 0
      + setting_type = "boolean"
    }

  # module.flags.configcat_setting.my_second_flag will be created
+ resource "configcat_setting" "my_second_flag" {
      + config_id    = (known after apply)
      + hint         = (known after apply)
      + id           = (known after apply)
      + key          = "MySecondFlag"
      + name         = "My Second Flag"
      + order        = 0
      + setting_type = "boolean"
    }

  # module.flags.configcat_setting_value_v2.my_first_flag_value_forno will be created
+ resource "configcat_setting_value_v2" "my_first_flag_value_forno" {
      + environment_id  = "08ddc62c-1047-4871-8ffa-78230983a9d9"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = jsonencode(
            {
              + active      = true
              + expiry_date = "2024-12-31"
              + owner       = "qa-team"
              + priority    = "high"
            }
        )
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + value           = {
          + bool_value = false
        }
    }

  # module.flags.configcat_setting_value_v2.my_first_flag_value_prod will be created
+ resource "configcat_setting_value_v2" "my_first_flag_value_prod" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = jsonencode(
            {
              + active      = true
              + expiry_date = "2024-12-31"
              + owner       = "qa-team"
              + priority    = "high"
            }
        )
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + value           = {
          + bool_value = false
        }
    }

  # module.flags.configcat_setting_value_v2.my_first_flag_value_staging will be created
+ resource "configcat_setting_value_v2" "my_first_flag_value_staging" {
      + environment_id = "08ddc62c-15af-41a7-8157-8c8e34b9750e"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

  # module.flags.configcat_setting_value_v2.my_second_flag_value_forno will be created
+ resource "configcat_setting_value_v2" "my_second_flag_value_forno" {
      + environment_id  = "08ddc62c-1047-4871-8ffa-78230983a9d9"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = jsonencode(
            {
              + active      = true
              + expiry_date = "2024-12-31"
              + owner       = "qa-team"
              + priority    = "high"
            }
        )
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + value           = {
          + bool_value = false
        }
    }

  # module.flags.configcat_setting_value_v2.my_second_flag_value_prod will be created
+ resource "configcat_setting_value_v2" "my_second_flag_value_prod" {
      + environment_id  = "08ddc62c-0cc2-43e7-8f61-400953081bfe"
      + id              = (known after apply)
      + init_only       = true
      + mandatory_notes = jsonencode(
            {
              + active      = true
              + expiry_date = "2024-12-31"
              + owner       = "qa-team"
              + priority    = "high"
            }
        )
      + setting_id      = (known after apply)
      + setting_type    = (known after apply)
      + value           = {
          + bool_value = false
        }
    }

  # module.flags.configcat_setting_value_v2.my_second_flag_value_staging will be created
+ resource "configcat_setting_value_v2" "my_second_flag_value_staging" {
      + environment_id = "08ddc62c-15af-41a7-8157-8c8e34b9750e"
      + id             = (known after apply)
      + init_only      = true
      + setting_id     = (known after apply)
      + setting_type   = (known after apply)
      + value          = {
          + bool_value = false
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ config_name = "POC Config v5"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d bruno-athaide-product-test/poc-config-v5
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://617d36dbbc68.ngrok-free.app/lock?id=caioq%252Fpoc-configcat-atlantis%252Fbruno-athaide-product-test%252Fpoc-config-v5%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d bruno-athaide-product-test/poc-config-v5
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
### 2. dir: `bruno-athaide-product-test/poc-config-v5/flags` workspace: `default`
**Plan Error**
```
running 'sh -c' '/opt/homebrew/bin/terraform plan -input=false -refresh -out "/Users/caio.queiroz/.atlantis/repos/caioq/poc-configcat-atlantis/7/default/bruno-athaide-product-test/poc-config-v5/flags/default.tfplan"' in '/Users/caio.queiroz/.atlantis/repos/caioq/poc-configcat-atlantis/7/default/bruno-athaide-product-test/poc-config-v5/flags': exit status 1
╷
│ Error: No value for required variable
│ 
│   on variables.tf line 2:
│    2: variable "config_id" {
│ 
│ The root module input variable "config_id" is not set, and has no default
│ value. Use a -var or -var-file command line argument to provide a value for
│ this variable.
╵

```

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```